Revit 2027 API
NurbsSurfaceData Constructor
 Copy constructor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public NurbsSurfaceData(
	NurbsSurfaceData other
)
Public Sub New (
	other As NurbsSurfaceData
)
public:
NurbsSurfaceData(
	NurbsSurfaceData^ other
)
new :
        other : NurbsSurfaceData -> NurbsSurfaceData
Parameters
other NurbsSurfaceData
 The NurbsSurfaceData to copy.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace